<b>Given a DataFrame with 'Salary' column, filter and display the rows where the salary is greater than 50000.</b>

In [1]:
import pandas as pd

In [1]:
data = {'emp':['A','B','C','D','E','F'],
       'salary':[40000,50000,60000,70000,80000,75000]}

In [7]:
df = pd.DataFrame(data)
df

  emp  salary
0   A   40000
1   B   50000
2   C   60000
3   D   70000
4   E   80000
5   F   75000

In [10]:
df[df['salary']>50000]

  emp  salary
2   C   60000
3   D   70000
4   E   80000
5   F   75000

In [14]:
df['id'] = [44,55,23,32,87,12]

<b> filter emp with salary > 60000 and even id</b>

In [12]:
df

  emp  salary  id
0   A   40000  44
1   B   50000  55
2   C   60000  23
3   D   70000  32
4   E   80000  87
5   F   75000  12

In [30]:
df[(df['salary']>60000) & (df['id']%2==0)]

  emp  salary  id
3   D   70000  32
5   F   75000  12

<b>Create a DataFrame with columns 'Country', 'Population', and 'Capital'. Filter and display the rows where the country name contains the letter 'D'.</b>

In [31]:
data = {'Country': ['USA', 'China', 'India', 'Brazil'],
        'Population': [331002651, 1444216107, 1380004385, 212559417],
        'Capital': ['Washington D.C.', 'Beijing', 'New Delhi', 'Brasília']}

In [33]:
df = pd.DataFrame(data)
df

  Country  Population          Capital
0     USA   331002651  Washington D.C.
1   China  1444216107          Beijing
2   India  1380004385        New Delhi
3  Brazil   212559417         Brasília

In [41]:
df[df['Capital'].apply(lambda x : 'D' in x or 'd' in x) ]

  Country  Population          Capital
0     USA   331002651  Washington D.C.
2   India  1380004385        New Delhi

In [47]:
df[df['Capital'].str.contains('d', case=False)]

  Country  Population          Capital
0     USA   331002651  Washington D.C.
2   India  1380004385        New Delhi

<b> Given a DataFrame with columns 'Product', 'Price', and 'Stock'. Display only the rows where the stock is not zero.</b>

In [48]:
data = {'product':['A','B','C'],
       'stock':[0,4,2]}

In [49]:
df = pd.DataFrame(data)
df

  product  stock
0       A      0
1       B      4
2       C      2

In [50]:
df[df['stock']!=0]

  product  stock
1       B      4
2       C      2

<b>Create a DataFrame with columns 'City' and 'Population'. Select and display the rows where the city is either 'New York' or 'London'.</b>

In [51]:
data = {'Country': ['USA', 'China', 'India', 'Brazil', 'Canada', 'Australia'],
        'Population': [331002651, 1444216107, 1380004385, 212559417, 37742154, 25499884],
        'Capital': ['Washington D.C.', 'Beijing', 'New Delhi', 'Brasília', 'Ottawa', 'Canberra']}

In [52]:
df = pd.DataFrame(data)
df

     Country  Population          Capital
0        USA   331002651  Washington D.C.
1      China  1444216107          Beijing
2      India  1380004385        New Delhi
3     Brazil   212559417         Brasília
4     Canada    37742154           Ottawa
5  Australia    25499884         Canberra

In [58]:
df[(df['Country']=='India') | (df['Country'] == 'USA')]

  Country  Population          Capital
0     USA   331002651  Washington D.C.
2   India  1380004385        New Delhi

<b> Employee with salary between 50k to 80k</b>

In [59]:
data = {'emp':['A','B','C','D','E','F'],
       'salary':[40000,50000,60000,70000,80000,75000]}

In [60]:
df = pd.DataFrame(data)
df

  emp  salary
0   A   40000
1   B   50000
2   C   60000
3   D   70000
4   E   80000
5   F   75000

In [61]:
df[(df['salary']>50000) & (df['salary']<80000)]

  emp  salary
2   C   60000
3   D   70000
5   F   75000

<b>Create a DataFrame with columns 'Name', 'Age', 'Salary', and 'Department'. Use the query method to select and display the rows where the salary is greater than 60000 and the department is 'IT'.</b>

In [62]:
data = {'Name': ['John', 'Alice', 'Bob', 'Eve'],
        'Age': [30, 28, 22, 35],
        'Salary': [75000, 60000, 80000, 70000],
        'Department': ['IT', 'HR', 'IT', 'Finance']}

In [63]:
df= pd.DataFrame(data)
df

    Name  Age  Salary Department
0   John   30   75000         IT
1  Alice   28   60000         HR
2    Bob   22   80000         IT
3    Eve   35   70000    Finance

In [76]:
df.query('Salary > 60000 and Department == "IT"')

   Name  Age  Salary Department
0  John   30   75000         IT
2   Bob   22   80000         IT

<b>Create a DataFrame with columns 'Name', 'Age', and 'Address'. Filter and display the rows where the address is not null.</b>

In [90]:
data = {'Name': ['John', 'Alice', 'Bob', 'Eve'],
        'Age': [30, 28, 22, 35],
        'Address': ['123 Main St', None, '456 Oak Ave', '789 Pine Ln']}

In [91]:
df = pd.DataFrame(data)
df

    Name  Age      Address
0   John   30  123 Main St
1  Alice   28         None
2    Bob   22  456 Oak Ave
3    Eve   35  789 Pine Ln

In [92]:
df[df['Address'].notnull()]

   Name  Age      Address
0  John   30  123 Main St
2   Bob   22  456 Oak Ave
3   Eve   35  789 Pine Ln

In [94]:
df[df['Address'].notna()]

   Name  Age      Address
0  John   30  123 Main St
2   Bob   22  456 Oak Ave
3   Eve   35  789 Pine Ln

In [98]:
df.query('Address.notna()')

   Name  Age      Address
0  John   30  123 Main St
2   Bob   22  456 Oak Ave
3   Eve   35  789 Pine Ln

<b>Given a DataFrame with columns 'Date', 'Temperature', and 'Rainfall'. Filter and display the rows where the temperature is above 30 and rainfall is less than 5.</b>

In [99]:
data = {'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04'],
        'Temperature': [28, 32, 31, 30],
        'Rainfall': [3, 2, 5, 4]}

In [100]:
df = pd.DataFrame(data)
df

         Date  Temperature  Rainfall
0  2022-01-01           28         3
1  2022-01-02           32         2
2  2022-01-03           31         5
3  2022-01-04           30         4

In [101]:
df.query('Temperature > 30 and Rainfall < 5')

         Date  Temperature  Rainfall
1  2022-01-02           32         2

In [102]:
df[(df['Temperature']+df['Rainfall'])==31]

         Date  Temperature  Rainfall
0  2022-01-01           28         3

<b>Given a DataFrame df with columns 'ID', 'Name', and 'Score', set the 'ID' column as the index of the DataFrame.</b>

In [103]:
df

         Date  Temperature  Rainfall
0  2022-01-01           28         3
1  2022-01-02           32         2
2  2022-01-03           31         5
3  2022-01-04           30         4

In [105]:
df.set_index(keys = ['Date'])

            Temperature  Rainfall
Date
2022-01-01           28         3
2022-01-02           32         2
2022-01-03           31         5
2022-01-04           30         4

<b>Create a DataFrame df with a hierarchical index using two columns 'Category' and 'Subcategory'. Perform indexing to retrieve information for a specific 'Subcategory'.</b>

In [107]:
data = {'Value': [10, 15, 20, 25, 30],
        'Description': ['A', 'B', 'C', 'D', 'E']}
categories = ['Category1', 'Category1', 'Category2', 'Category2', 'Category3']
subcategories = ['SubcategoryA', 'SubcategoryB', 'SubcategoryA', 'SubcategoryB', 'SubcategoryC']

In [108]:
ind = pd.MultiIndex.from_arrays([categories,subcategories])

In [109]:
df = pd.DataFrame(data , index = ind)
df

                        Value Description
Category1 SubcategoryA     10           A
          SubcategoryB     15           B
Category2 SubcategoryA     20           C
          SubcategoryB     25           D
Category3 SubcategoryC     30           E

In [117]:
df.index_names=['categorys','subcategory']

In [124]:
df.loc['Category1', 'SubcategoryA']

Value          10
Description     A
Name: (Category1, SubcategoryA), dtype: object

<b>Create a DataFrame df with multi-level columns ('Subject', 'Test1', 'Test2'). Perform indexing to select scores for 'Test1' in 'Math' and 'Physics'.</b>

In [2]:
data = {
    ('Math', 'Test1'): [90, 85, 88],
    ('Math', 'Test2'): [95, 92, 89],
    ('Physics', 'Test1'): [78, 80, 85],
    ('Physics', 'Test2'): [82, 88, 90]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   Math       Physics
  Test1 Test2   Test1 Test2
0    90    95      78    82
1    85    92      80    88
2    88    89      85    90

In [8]:
df.iloc[:,::2]

   Math Physics
  Test1   Test1
0    90      78
1    85      80
2    88      85

<b>Create a DataFrame with a multi-index, where the first level is 'Year' and the second level is 'Quarter'. Populate the DataFrame with random data.</b>

In [11]:
year = ['2020','2021','2022']
quarter = ['q1','q2','q3','q4']

In [10]:
data = {'sales':[2000,3000,4400,1200,3400,2300,4566,7890,1123,3456,5556,8909],
       'profit':[1200,1400,400,200,2000,1200,1500,3000,100,400,2000,4000]}

In [61]:
ind = pd.MultiIndex.from_product([year,quarter],names=['year','quarter'])

In [62]:
df = pd.DataFrame(data, index=ind)
df

              sales  profit
year quarter
2020 q1        2000    1200
     q2        3000    1400
     q3        4400     400
     q4        1200     200
2021 q1        3400    2000
     q2        2300    1200
     q3        4566    1500
     q4        7890    3000
2022 q1        1123     100
     q2        3456     400
     q3        5556    2000
     q4        8909    4000

<b>Given a MultiIndex DataFrame, write code to select:

All data for the year 2022.</br>
Data for the first quarter of every year.</br>
Data for the second quarter of the year 2023.</b>

In [19]:
df.loc['2022':,:]

         sales  profit
2022 q1   1123     100
     q2   3456     400
     q3   5556    2000
     q4   8909    4000

In [31]:
df.loc[pd.IndexSlice[:,'q1'],:]

         sales  profit
2020 q1   2000    1200
2021 q1   3400    2000
2022 q1   1123     100

In [35]:
df.loc[pd.IndexSlice['2022','q2'],:]

sales     3456
profit     400
Name: (2022, q2), dtype: int64

<b>Given a MultiIndex DataFrame with columns 'Revenue' and 'Profit', calculate the total revenue and profit for each year.</b>

In [41]:
df.index_name

['year', 'quarter']

In [39]:
df.index_name = ['year','quarter']

C:\Users\kumar\AppData\Local\Temp\ipykernel_37364\1294672060.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.index_name = ['year','quarter']

In [43]:
adf = df.reset_index()

In [58]:
adf.groupby('level_0').sum('sales')

         sales  profit
level_0
2020     10600    3200
2021     18156    7700
2022     19044    6500

In [65]:
df.groupby('year').sum()

      sales  profit
year
2020  10600    3200
2021  18156    7700
2022  19044    6500

<b>Take a MultiIndex DataFrame and pivot it so that the 'Year' becomes columns and 'Quarter' becomes rows.</b>

In [69]:
adf.pivot(columns='level_0',index='level_1')

        sales             profit
level_0  2020  2021  2022   2020  2021  2022
level_1
q1       2000  3400  1123   1200  2000   100
q2       3000  2300  3456   1400  1200   400
q3       4400  4566  5556    400  1500  2000
q4       1200  7890  8909    200  3000  4000

<b>Given a MultiIndex DataFrame, sort it based on the 'Year' in descending order and then the 'Quarter' in ascending order.</b>

In [73]:
df.sort_index(level = ['year','quarter'],ascending=[False,True])

              sales  profit
year quarter
2022 q1        1123     100
     q2        3456     400
     q3        5556    2000
     q4        8909    4000
2021 q1        3400    2000
     q2        2300    1200
     q3        4566    1500
     q4        7890    3000
2020 q1        2000    1200
     q2        3000    1400
     q3        4400     400
     q4        1200     200

In [75]:
df.sort_values(by = ['year','quarter'],ascending=[False,True])

              sales  profit
year quarter
2022 q1        1123     100
     q2        3456     400
     q3        5556    2000
     q4        8909    4000
2021 q1        3400    2000
     q2        2300    1200
     q3        4566    1500
     q4        7890    3000
2020 q1        2000    1200
     q2        3000    1400
     q3        4400     400
     q4        1200     200

<b>Take a MultiIndex DataFrame and reset the index, converting the multi-index into regular columns.</b>

In [78]:
df.reset_index(names=['year','quarter'])

    year quarter  sales  profit
0   2020      q1   2000    1200
1   2020      q2   3000    1400
2   2020      q3   4400     400
3   2020      q4   1200     200
4   2021      q1   3400    2000
5   2021      q2   2300    1200
6   2021      q3   4566    1500
7   2021      q4   7890    3000
8   2022      q1   1123     100
9   2022      q2   3456     400
10  2022      q3   5556    2000
11  2022      q4   8909    4000

<b>Group a MultiIndex DataFrame by the 'Year' and calculate the average value for each group.</b>

In [82]:
df.groupby('year').sales.mean()

year
2020    2650.0
2021    4539.0
2022    4761.0
Name: sales, dtype: float64

<b>Given a MultiIndex DataFrame, use slicing to select data for a specific range of years and quarters.</b>

In [85]:
df.loc[('2020','q2'):('2021','q3'),:]

              sales  profit
year quarter
2020 q2        3000    1400
     q3        4400     400
     q4        1200     200
2021 q1        3400    2000
     q2        2300    1200
     q3        4566    1500